import React from 'react'
import { BreadCrumbs } from '../../../ui/pageRelated/BreadCrumbs/BreadCrumbs'
import { PageContentWrapper } from '../../../ui/pageRelated/PageContentWrapper/PageContentWrapper'
import { PageHeader } from '../../../ui/pageRelated/PageHeader/PageHeader'

/** Страница истории изменений */
function HistoryPage() {
	return (
		<PageContentWrapper>
			<BreadCrumbs />
			<PageHeader>История обновлений</PageHeader>
			<div>
				<p>4 мая 2024 — добавлено модальное окно прохождения упражнений.</p>
				<p>13 мая 2024 — добавлена 3 статья «Прилагательные».</p>
				<p>14 мая 2024 — добавлена 4 статья «Неопределённый артикль a».</p>
				<p>14 мая 2024 — добавлена 5 статья «Множественное число существительных».</p>
				<p>14 мая 2024 — добавлена 6 статья «Вопрос и отрицание в предложениях с be».</p>
				<p>14 мая 2024 — добавлена 7 статья «Указательные местоимения».</p>
				<p>14 мая 2024 — добавлена 8 статья «Притяжательные местоимения».</p>
				<p>16 мая 2024 — добавлена 9 глава «Притяжательный падеж».</p>
				<p>16 мая 2024 — добавлена 10 глава «Определённый артикль the».</p>
				<p>17 мая 2024 — добавлена 11 глава «Степени сравнения прилагательных».</p>
				<p>18 мая 2024 — добавлена 12 глава «Сокращённая запись be и will».</p>
				<p>18 мая 2024 — добавлена 13 глава «Утвердительные предложения в Simple».</p>
				<p>23 мая 2024 — добавлена 14 глава «Отличие be от Simple».</p>
				<p>23 мая 2024 — добавлена 15 глава «Вопрос и отрицание в Simple».</p>
				<p>24 мая 2024 — добавлена 16 глава «Смысловой глагол do».</p>
				<p>24 мая 2024 — добавлена 17 глава «Короткие ответы».</p>
				<p>24 мая 2024 — добавлена 18 глава «Разделительный вопрос».</p>
				<p>24 мая 2024 — добавлена 19 глава «Вопросы с отрицанием».</p>
				<p>25 мая 2024 — добавлена 20 глава «Личные местоимения в дополнении».</p>
				<p>27 мая 2024 — добавлена 21 глава «Нулевой артикль».</p>
				<p>28 мая 2024 — добавлена 22 глава «Предлог of».</p>
				<p>30 мая 2024 — добавлена 23 глава «Much и many».</p>
				<p>1 июня 2024 — добавлена 24 глава «Few и little».</p>
				<p>1 июня 2024 — добавлена 25 глава «Инфинитив».</p>
				<p>2 июня 2024 — добавлена 26 глава «Предлог to».</p>
				<p>2 июня 2024 — добавлена 27 глава «Предлог in».</p>
			</div>
		</PageContentWrapper>
	)
}

export default HistoryPage
